<template>
    <div class="grid grid-cols-12 gap-8 my-16 pb-[6%] relative mx-[8%]">
        <div class="col-span-12">
            <h1 class="text-4xl">退会</h1>
        </div>
        <div class="col-span-12 py-14">
            <div class="flex flex-col space-y-4">
                <p class="text-lg">
                    この度は、ThesisMartをご利用いただき、誠にありがとうございます。
                </p>
                <p class="text-lg">
                    退会をご検討いただいているとのこと、誠に残念に思っております。
                    ご多忙の中でご決断いただくのは、決して簡単なことではないと存じますが、私たちのサービスがご満足に至らなかった点や改善が必要であるとお感じになった点について、改めてお伺いさせていただけますと幸いです。
                    私たちはすべてのお客様により良いサービスを提供できるよう、日々努めており、お客様からのフィードバックを基に常に改善を重ねています。
                    これまでにいただいた貴重なご意見も、今日のサービスの質を支えており、お客様一人ひとりの声が今後の改善において大切な存在です。
                </p>
                
                <div class="col-span-12 flex-1 border-b border-gray-500"></div>

                <h3 class="text-2xl">退会に伴う損失のご案内</h3>

                <p class="text-lg">
                    私たちの会員として、長年ご利用いただく中で蓄積された特典やご利用履歴、またお客様に合わせたカスタマイズされた体験が、退会されることで失われます。
                    ご参考までに、サービス終了後に影響を受けるいくつかの重要な項目を以下にご案内させていただきます。
                </p>

                <h4 class="text-xl font-bold">ポイントの喪失</h4>
                <p class="text-lg">
                    これまでに貯めたポイントは、退会の手続きを進めると全て無効となります。
                    ポイントは会員様のご利用をサポートし、お得にショッピングを楽しんでいただくための大切な仕組みです。
                    貯まったポイントをご活用いただくことで新しいショッピング体験を得ることが可能です。
                </p>

                <h4 class="text-xl font-bold">特別なクーポンと限定セール情報の終了</h4>
                <p class="text-lg">
                    退会されると、会員様向けの特別なクーポンや限定セールのご案内が一切受け取れなくなります。
                    会員様専用の情報提供は、最先端のトレンドに基づき、毎月新しい内容に更新されています。
                    季節ごとに更新される特別割引や、会員様のみが利用できる割引商品も多く、サービスを利用し続けることで、よりお得な価格でのお買い物が可能となります。
                </p>

                <h4 class="text-xl font-bold">便利な機能の利用停止</h4>
                <p class="text-lg">
                    私たちのサービスでは、お客様の利便性を重視し、さまざまな便利機能をご提供しております。
                    例えば、ショッピングリマインダー、割引対象商品リスト、個別の通知設定など、日常のショッピング体験をより充実させるための工夫が盛り込まれています。
                    退会後は、これらの機能が一切ご利用いただけなくなります。
                </p>

                <div class="col-span-12 flex-1 border-b border-gray-500"></div>

                <h3 class="text-2xl">お問い合わせとサポート窓口</h3>
                <p class="text-lg">
                    もし退会をお考えの理由やサービスに対するご意見がございましたら、ぜひお気軽にお問合せいただければと思います。
                    会員様の率直な声をもとに、サービスの質の向上に努めてまいります。
                    また、現在退会をお悩みの方に向けた特別なサポートも提供しておりますので、ぜひ一度ご相談ください。
                </p>

                <p class="text-lg">
                    このページの内容をご確認いただき、<NuxtLink to="/setting/d_deleteAccount_2" class="underline hover:text-blue-500">次のページ</NuxtLink>で退会手続きを続けることができますが、もう一度よくご検討いただけますようお願い申し上げます。
                </p>
            </div>
        </div>

        <div class="col-start-6 col-span-2">
            <a>
                <NuxtLink to="/setting/account">
                    <button class="btn btn-active text-lg w-full">退会せずに戻る</button>
                </NuxtLink>
            </a>
        </div>
    </div>
</template>