<template>
    <div class="grid grid-cols-12 gap-8 my-16 pb-[6%] relative mx-[8%]">
        <div class="col-span-12">
            <h1 class="text-4xl">セール利用規約</h1>
        </div>
        <div class="col-span-12 py-14">
            <div class="flex flex-col space-y-4">
                <p class="text-lg">
                    この利用規約（以下「本規約」）は、[弊社名]（以下「当社」）が提供するお買い得セール（以下「本セール」）の利用条件を定めるものです。
                    本セールに参加されるお客様（以下「お客様」）は、本規約にご同意いただく必要があります。
                </p>

                <h3 class="text-2xl">第1条（適用）</h3>
                <p class="text-lg">
                    本規約は、本セールの利用に関し、当社とお客様との間の権利義務を定めるものです。お客様は、本規約に従って本セールをご利用いただきます。
                </p>

                <h3 class="text-2xl">第2条（個人情報の取り扱い）</h3>

                <h4 class="text-xl">1. 当社の個人情報取得および利用</h4>
                <p class="text-lg">
                    お客様が本セールに参加する場合、当社は、氏名、住所、メールアドレス、電話番号等の個人情報を取得し、本セールの実施および今後のサービス向上のために利用します。
                </p>

                <h4 class="text-xl">2. 第三者提供および情報配信の同意</h4>
                <p class="text-lg">
                    お客様が本セールに参加し本規約に同意いただいた場合、当社は、お客様の個人情報を当社が提携する第三者（以下「提携先」）に提供することがあります。
                    提携先は、お客様に対し、各社が提供する製品やサービスに関するご案内、キャンペーン情報、お得なセールの通知、アンケートのお願い等の情報をお送りする目的で、お客様の個人情報を利用します。
                </p>
                <h4 class="text-xl">3. 第三者提供の対象となる情報</h4>
                <p class="text-lg">
                    提供される情報は、お客様の氏名、住所、電話番号、メールアドレス、購入履歴等を含みますが、これに限定されません。
                </p>

                <h4 class="text-xl">4. 情報配信の停止手続き</h4>
                <p class="text-lg">
                    提携先からの情報配信を希望されない場合は、各提携先の案内に従って、配信停止の手続きを行うことができます。当社では、配信停止の代行は行っておりませんので、あらかじめご了承ください。
                </p>


                <h3 class="text-2xl">第3条（禁止事項）</h3>
                <p class="text-lg">
                    本規約は、本セールの利用に関し、当社とお客様との間の権利義務を定めるものです。お客様は、本規約に従って本セールをご利用いただきます。
                </p>

                <h3 class="text-2xl">第4条（免責事項）</h3>
                <p class="text-lg">
                    お客様は、本セールの利用にあたり、以下の行為を行ってはならないものとします。
                </p>
                <ol class=" list-decimal text-lg pl-8">
                    <li>虚偽の情報を提供する行為</li>
                    <li>他のお客様や第三者の権利を侵害する行為</li>
                    <li>その他、当社が不適切と判断する行為</li>
                </ol>


                <h3 class="text-2xl">第5条（規約の変更）</h3>
                <ol class="list-decimal text-lg pl-8">
                    <li>本セールの内容や価格については、予告なく変更される場合があります。当社はこれによりお客様に生じた損害について、一切の責任を負いません。</li>
                    <li>提携先のサービス内容に関して、当社は一切の保証を行いません。</li>
                </ol>

                <p class="text-lg">
                    本セールにご参加いただく場合、上記の規約に同意されたものとみなされます。
                </p>
            </div>
        </div>
    </div>
</template>